Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Causes the script to run only with a 64-bit interpreter (EXE).
ja: 64ビットインタプリタ（EXE）のみでスクリプトを実行するようにします。

source: Causes the script to wait 2 seconds instead of 1 second before giving up accessing the clipboard and displaying an error message.
ja: クリップボードへのアクセスをあきらめ、エラーメッセージを表示する前に、スクリプトが1秒ではなく2秒待機するようになります。

source: Causes the smallest possible delay to occur after each control-modifying function.
ja: 制御を変更する各機能の後に、可能な限り小さな遅延が発生するようにします。

source: Causes the smallest possible delay to occur after each keystroke sent via Send or ControlSend.
ja: SendまたはControlSendで送信される各キーストロークの後に、可能な限り小さな遅延が発生するようにします。

source: Causes the smallest possible delay to occur after each mouse movement or click.
ja: マウスの移動やクリックのたびに、可能な限り小さな遅延を発生させます。

source: Causes the specified function to be called automatically when an unhandled error occurs.
ja: 未処理のエラーが発生した場合に、指定された関数が自動的に呼び出されるようにします。

source: Causes the specified function to be called automatically when the script exits.
ja: スクリプトの終了時に、指定された関数が自動的に呼び出されるようにします。

source: Causes the specified function to be called automatically whenever the clipboard's content changes.
ja: クリップボードの内容が変更されるたびに、指定された関数が自動的に呼び出されるようにします。

source: Causes the specified function to be called automatically whenever the script receives the specified message.
ja: スクリプトが指定されたメッセージを受信するたびに、指定された関数が自動的に呼び出されるようにします。

source: Causes the state of CapsLock not to be changed at all.
ja: CapsLockの状態を全く変化させないようにします。

source: Causes those hot items that may be activated to be displayed with underlined text.
ja: アクティブになる可能性のあるホットアイテムに下線を引く。

source: Causes those non-hot items that may be activated to be displayed with underlined text.
ja: アクティベートされる可能性のある非ホット項目を下線付きテキストで表示する。

source: Caution should be used when monitoring system messages (those below 0x0400).
ja: システムメッセージ（0x0400以下のメッセージ）を監視する場合は、注意が必要です。

source: Caveat: OnError is ineffective while Try is active.
ja: 注意事項：Tryが有効な間はOnErrorは無効です。

source: Centers a window on the screen.
ja: 画面上のウィンドウを中央に配置する。

source: Centers text in a multiline edit control.
ja: 複数行編集コントロール内のテキストを中央揃えする。

source: Centers the bitmap in the control.
ja: コントロール内のビットマップを中央に配置する。

source: Centers the control's text within its available width.
ja: コントロールのテキストを使用可能な幅の範囲内でセンタリングします。

source: Centers the text horizontally within the control's available width.
ja: コントロールの使用可能な幅内で、テキストを水平方向にセンタリングする。

source: Centers the text in the column.
ja: カラム内のテキストをセンタリングします。

source: Centers the window horizontally and vertically on the screen.
ja: 画面上でウィンドウを縦横にセンタリングします。

source: Centers the window horizontally on the screen.
ja: 画面上でウィンドウを水平方向にセンタリングします。

source: Centers the window vertically on the screen.
ja: 画面上でウィンドウを縦方向にセンタリングします。

source: Certain controls may contain an ampersand (&) to create a keyboard shortcut, which might be displayed in the control's text as an underlined character (depending on system settings).
ja: 一部のコントロールには、キーボードショートカットを作成するためのアンパサンド（&）が含まれている場合があり、コントロールのテキストに下線文字として表示される場合があります（システム設定に依存）。

source: Certain games and other specialized applications may require a delay inside each keystroke; that is, after the press of the key but before its release.
ja: ゲームなどの特殊なアプリケーションでは、キーを押した後、離すまでの間に遅延が必要な場合があります。

source: Certain limitations may be encountered when dealing with strings.
ja: 文字列を扱う場合、一定の制限が発生する場合があります。

source: Certain restrictions apply to variable names - see Names for details.
ja: 変数名には一定の制約があります。詳細は「名前」を参照してください。

source: Certain special folders within the operating system are identified by unique strings.
ja: オペレーティング・システム内の特定の特別なフォルダは、固有の文字列で識別される。

source: Certain style changes require that the entire window be redrawn using WinRedraw.
ja: 特定のスタイル変更には、WinRedrawを使用してウィンドウ全体を再描画する必要があります。

source: Certain syntax errors are no longer tolerated
ja: 特定の構文エラーが許容されなくなった

source: Certain syntax errors which were tolerated by AutoHotkey Basic are not tolerated by AutoHotkey_L.
ja: AutoHotkey Basicでは許容されていた構文エラーも、AutoHotkey_Lでは許容されないものがあります。

source: Certain types of hook hotkeys can still be triggered when BlockInput is on.
ja: BlockInputがオンの場合でも、ある種のフックホットキーはトリガーすることができます。

source: Certain types of controls send a WM_COMMAND message whenever an interesting event occurs.
ja: ある種のコントロールは、興味深いイベントが発生するたびにWM_COMMANDメッセージを送信します。

source: Certain types of controls send a WM_NOTIFY message whenever an interesting event occurs or the control requires information from the program.
ja: ある種のコントロールは、興味深いイベントが発生したり、コントロールがプログラムから情報を要求されたりすると、WM_NOTIFYメッセージを送信します。

source: Certain types of controls, such as RichEdit20A, might not produce the correct text in some cases (e.g. Metapad).
ja: RichEdit20Aなどのコントロールの種類によっては、正しいテキストが出力されない場合があります（例：Metapad）。

source: Change options on-the-fly.
ja: オプションをその場で変更。

source: Change the first two parameters to suit your preferences:
ja: 最初の2つのパラメータは、好みに合わせて変更してください：

source: Change the value of an item (Index must be between 1 and Length, or an equivalent reverse index):
ja: 項目の値を変更する（Indexは1からLengthの間、または同等の逆インデックスでなければならない）：

source: Changed COM method and property calls to pass large integers as VT_I8, not VT_R8 (floating-point), so the original type and precision is retained.
ja: COMのメソッドとプロパティの呼び出しで、大きな整数をVT_R8（浮動小数点）ではなくVT_I8として渡すように変更しました。

source: Changed ControlGetFocus to return 0 when focus can't be determined, such as when a console window is active.
ja: コンソールウィンドウがアクティブな場合など、フォーカスを決定できないときに ControlGetFocus関数が0を返すように変更しました。

source: Changed Hotkey function to throw ValueError if Options contains an invalid option.
ja: Hotkey関数に無効なオプションが含まれているときにValueErrorをスローするように変更しました。

source: Changed UnsetError message to suggest a global declaration instead of appending "(same name as a global)" after the variable name.
ja: 変数名の後に"same name as a global "を追加する代わりにグローバル宣言を提案するようにUnsetErrorメッセージを変更しました。

source: Changed VarUnset warning message for consistency with UnsetError.
ja: UnsetErrorとの一貫性を保つためにVarUnsetの警告メッセージを変更しました。

source: Changed debugger to ignore errors thrown by __Enum (treat as no items).
ja: __Enumがスローしたエラーを項目なしとみなして無視するようにデバッガを変更しました。

source: Changed debugger to suppress exceptions during property evaluation.
ja: プロパティの評価中に例外を抑制するように変更しました。

source: Changed enumerator model:
ja: 列挙者モデルの変更：

source: Changed error message for a == b && c() and similar cases to avoid alluding to legacy =.
ja: a == b && c()と同様の場合のエラーメッセージを変更し、レガシー=を暗示しないようにしました。

source: Changed font to Segoe UI size 9, consistent with Dash.
ja: フォントを9ポイントのSegoe UIに変更してDashと統一しました。

source: Changed the Reload button on error/warning dialogs to explicitly close the dialog, even if the current script instance isn't terminated.
ja: エラー/警告ダイアログのリロードボタンを、現在のスクリプトインスタンスが終了していなくても、明示的にダイアログを閉じるように変更しました。

source: Changes & New Features
ja: 変更点・新機能

source: Changes & New Features | AutoHotkey v2
ja: 変更点・新機能｜AutoHotkey v2

source: Changes hotstring options or ending characters.
ja: ホットストリングのオプションや終了文字を変更します。

source: Changes MenuItemName to a gray color to indicate that the user cannot select it.
ja: MenuItemNameをグレー色に変更し、ユーザーが選択できないことを示します。

source: Changes a hotkey to allow 5 threads.
ja: 5つのスレッドを許可するようにホットキーを変更します。

source: Changes a menu item to a gray color to indicate that the user cannot select it.
ja: メニュー項目をグレーに変更し、ユーザーが選択できないことを示します。

source: Changes a mute setting of a sound device.
ja: サウンドデバイスのミュート設定を変更します。

source: Changes a property in the compiled executable's version information.
ja: コンパイルされた実行ファイルのバージョン情報のプロパティを変更します。

source: Changes a volume setting of a sound device.
ja: サウンドデバイスの音量設定を変更します。

source: Changes and new features introduced by the current branch of AutoHotkey development.
ja: AutoHotkey開発の現在のブランチによって導入された変更点および新機能。

source: Changes array-in-array behaviour.
ja: アレイインアレイの動作を変更します。

source: Changes between v1.0 and v1.1.
ja: v1.0とv1.1の間の変更。

source: Changes between v1.1 and v2.0.
ja: v1.1とv2.0の間の変更。

source: Changes details in the .exe's manifest.
ja: .exe のマニフェストの詳細を変更します。

source: Changes from v1.0 to v1.1
ja: v1.0からv1.1への変更

source: Changes from v1.0 to v1.1 | AutoHotkey v2
ja: v1.0からv1.1への変更｜AutoHotkey v2

source: Changes from v1.1 to v2.0
ja: v1.1からv2.0への変更

source: Changes from v1.1 to v2.0 | AutoHotkey v2
ja: v1.0からv2.1への変更｜AutoHotkey v2

source: Changes from v1.1 | AutoHotkey v2
ja: v1.1からの変更｜AutoHotkey v2

source: Changes how long the script keeps trying to access the clipboard when the first attempt fails.
ja: クリップボードへのアクセスに失敗したときに、スクリプトが試行し続ける時間を変更します。

source: Changes merged from v1.1.37.00 and v1.1.37.01:
ja: v1.1.37.00およびv1.1.37.01からの変更をマージ：

source: Changes other miscellaneous properties in the compiled executable's version information not covered by the SetProp directive.
ja: SetPropディレクティブでカバーされていない、 コンパイルされた実行ファイルのバージョン情報の その他の雑多なプロパティを変更する。

source: Changes the .exe's manifest.
ja: .exe のマニフェストを変更します。

source: Changes the language code.
ja: 言語コードを変更する。

source: Changes the attributes of one or more files or folders.
ja: 1つまたは複数のファイルまたはフォルダーの属性を変更します。

source: Changes the background color of the control.
ja: コントロールの背景色を変更します。

source: Changes the background color of the menu to ColorValue.
ja: メニューの背景色をColorValueに変更します。

source: Changes the background color of the menu.
ja: メニューの背景色を変更します。

source: Changes the column back to text-mode sorting, which is the initial default for every column.
ja: カラムをテキストモードでのソートに戻します（すべてのカラムの初期設定）。

source: Changes the company name.
ja: 社名を変更する。

source: Changes the date-time stamp of a file.
ja: ファイルの日付・タイムスタンプを変更します。

source: Changes the datetime stamp of one or more files or folders.
ja: 1つまたは複数のファイルまたはフォルダーのタイムスタンプを変更します。

source: Changes the default dialog title.
ja: デフォルトのダイアログのタイトルを変更します。

source: Changes the desktop wallpaper to the specified bitmap (.bmp) file.
ja: デスクトップの壁紙を、指定したビットマップ（.bmp）ファイルに変更します。

source: Changes the duration of interruptibility for newly launched threads.
ja: 新しく起動されたスレッドの割り込み可能時間を変更する。

source: Changes the executable subsystem to Console mode.
ja: 実行サブシステムをコンソールモードに変更する。

source: Changes the file description.
ja: ファイルの説明を変更します。

source: Changes the file version and the product version, in both text and raw binary format.
ja: ファイルのバージョンと製品のバージョンを、テキスト形式と生のバイナリ形式の両方で変更します。

source: Changes the file version, in both text and raw binary format.
ja: ファイルのバージョンを、テキスト形式と生のバイナリ形式の両方で変更します。

source: Changes the internal name.
ja: 内部名称を変更する。

source: Changes the legal copyright information.
ja: 法的な著作権情報を変更します。

source: Changes the legal trademarks information.
ja: 法定商標情報を変更する。

source: Changes the mod-date of all files that match a pattern.
ja: パターンに一致するすべてのファイルのmod-dateを変更します。

source: Changes the original filename information.
ja: 元のファイル名情報を変更する。

source: Changes the position and/or size of the specified window.
ja: 指定したウィンドウの位置や大きさを変更します。

source: Changes the priority level of the current thread.
ja: 現在のスレッドの優先度を変更する。

source: Changes the priority level of the first matching process.
ja: 最初のマッチング処理の優先度を変更します。

source: Changes the product name and the internal name.
ja: 製品名と内部名称を変更します。

source: Changes the product name.
ja: 商品名を変更します。

source: Changes the product version, in both text and raw binary format.
ja: 製品バージョンを、テキスト形式と生のバイナリ形式の両方で変更します。

source: Changes the resource language used by AddResource.
ja: AddResourceが使用するリソース言語を変更します。

source: Changes the resource language.
ja: リソースの言語を変更する。

source: Changes the script's tray icon (which is also used by GUI and dialog windows).
ja: スクリプトのトレイアイコン（GUIやダイアログウィンドウでも使用される）を変更します。

source: Changes the script's current working directory.
ja: スクリプトの現在の作業ディレクトリを変更します。

source: Changes the shape of the specified window to be the specified rectangle, ellipse, or polygon.
ja: 指定されたウィンドウの形状を、指定された矩形、楕円、多角形のいずれかに変更します。

source: Changes the style or extended style of the specified control, respectively.
ja: 指定されたコントロールのスタイルまたは拡張スタイルをそれぞれ変更します。

source: Changes the style or extended style of the specified window, respectively.
ja: 指定されたウィンドウのスタイル、拡張スタイルをそれぞれ変更します。

source: Changes the system's clock to the specified date and time.
ja: システムの時計を指定した日付と時刻に変更します。

source: Changes the text of Notepad's edit control.
ja: メモ帳のエディットコントロールのテキストを変更します。

source: Changes the text of a control.
ja: コントロールのテキストを変更します。

source: Changes the text of the main window's edit control.
ja: メインウィンドウのエディットコントロールのテキストを変更します。

source: Changes the title of Notepad.
ja: メモ帳のタイトルを変更します。

source: Changes the title of the specified window.
ja: 指定したウィンドウのタイトルを変更します。

source: Changes the volume label of the C drive.
ja: Cドライブのボリュームラベルを変更します。

source: Changes the volume label of the specified drive.
ja: 指定したドライブのボリュームラベルを変更します。

source: Changes the working directory for subsequent #Includes and FileInstalls.
ja: 以降の#IncludesとFileInstallsの作業ディレクトリを変更します。

source: Changes to the control which have not yet become visible prior to disabling redraw will generally not become visible until after redraw is re-enabled.
ja: 再描画を無効にする前にまだ表示されていなかったコントロールの変更は、通常、再描画が再有効になるまで表示されません。

source: Changes to the opposite of its previous state (On or Off).
ja: 以前の状態（オンまたはオフ）と逆の状態に変化する。

source: Changes:
ja: 変更：

source: Changing MsgBox's Button Names
ja: MsgBoxのボタン名の変更

source: Changing the icon will not unhide the tray icon if it was previously hidden by means such as #NoTrayIcon; to do that, use A_IconHidden := false.
ja: A_IconHidden := falseを使って変更しても、トレイアイコンが#NoTrayIconなどで非表示になっていた場合は、非表示は解除されません。

source: Changing the setting does not affect positions or sizes which have already been set.
ja: 設定を変更しても、すでに設定されている位置やサイズには影響しません。

source: Changing the tray icon also changes the icon displayed by InputBox and subsequently-created GUI windows.
ja: トレイアイコンを変更すると、InputBoxやその後に作成されるGUIウィンドウに表示されるアイコンも変更されます。

source: Changing the working directory in this way does not affect the script's initial working directory when it starts running (A_WorkingDir).
ja: この方法で作業ディレクトリを変更しても、スクリプトの実行開始時の初期作業ディレクトリ（A_WorkingDir）には影響しない。

source: Char Size
ja: 文字サイズ

source: Character code
ja: 文字コード

source: Character codes above 127 depend on your system's language settings (or the codepage chosen when the text was encoded, such as when it is written to a file).
ja: 127以上の文字コードは、お使いのシステムの言語設定（または、ファイルへの書き込みなど、テキストをエンコードする際に選択されたコードページ）に依存します。

source: Character codes are as defined by the UTF-16 format.
ja: 文字コードは、UTF-16形式で定義されたものです。

source: Character quality of the font is more important than exact matching of the logical-font attributes.
ja: フォントの文字品質は、論理フォント属性の完全一致よりも重要です。

source: Characters and events beyond this limit are not sent.
ja: この制限を超えた文字や事象は送信されません。

source: Characters beyond this length are ignored.
ja: この長さを超える文字は無視されます。

source: Characters in excess of this are not printed.
ja: これを超える文字は印刷されません。

source: Characters sent by SendEvent with the {Text} mode, {U+nnnn} or Unicode fallback method can trigger hotstrings.
ja: SendEventで{Text}モード、{U+nnnn}またはUnicode fallbackメソッドで送信された文字は、ホットストリングをトリガーすることができます。

source: Characters sent by the ASC (Alt+nnnnn) method cannot trigger a hotstring, even if SendLevel is used.
ja: ASC（Alt+nnnn）メソッドで送信された文字は、SendLevelが使用されていても、ホットストリングをトリガーすることはできません。

source: Characters sent this way usually do not trigger shortcut keys or hotkeys.
ja: この方法で送られた文字は、通常、ショートカットキーやホットキーは作動しません。

source: Characters that do not exist in the current keyboard layout (such as Ô in English) cannot be sent.
ja: 現在のキーボードレイアウトに存在しない文字（英語のÔなど）は、送信できません。

source: Check if a particular attribute (the Hidden attribute) is present in the retrieved string.
ja: 取得した文字列の中に特定の属性（Hidden属性）があるかどうかを確認します。

source: Check miscellaneous conditions based on a given value or variable reference.
ja: 与えられた値や変数の参照に基づき、様々な条件をチェックします。

source: Check that a string matches a specific pattern.
ja: 文字列が特定のパターンに一致するかどうかをチェックする。

source: Check the following boxes:
ja: 以下の項目にチェックを入れてください。

source: Check the following boxes: 1) Run minimized; 2) Capture output.
ja: 以下の項目にチェックを入れてください：1) 最小限の実行、2) 出力の捕捉。

source: Check the logical state of the key, which is the state that the OS and the active window believe the key to be in (not necessarily the same as the physical state).
ja: キーの論理状態（OSやアクティブウィンドウがキーがあると信じている状態）を確認します（物理状態と同じとは限りません）。

source: Check the type of a value, or whether a string can be interpreted as a value of that type.
ja: 値の型、または文字列がその型の値として解釈できるかどうかを確認します。

source: Check whether a string matches a specific pattern.
ja: 文字列が指定したパターンに一致するかをチェックします。

source: CheckBox: BS_AUTOCHECKBOX or BS_AUTO3STATE
ja: CheckBox：BS_AUTOCHECKBOXまたはBS_AUTO3STATE

source: Checkboxes are visible and functional with all list-view modes except the tile view mode.
ja: チェックボックスは、タイルビューモード以外のすべてのリストビューモードで表示され、機能する。

source: Checking for /restart in the command line ensures that the script does not enter a runaway loop in that case.
ja: コマンドラインで/restartをチェックすることで、その場合にスクリプトが暴走ループに入らないようにします。

source: Checks for the existence of a file or folder and returns its attributes.
ja: ファイルまたはフォルダの存在を確認し、その属性を返します。

source: Checks for the existence of a folder and returns its attributes.
ja: フォルダの存在を確認し、その属性を返します。

source: Checks for the presence of the F_OWNVALUE flag.
ja: F_OWNVALUEフラグがあるかどうかをチェックします。

source: Checks if a keyboard key or mouse/joystick button is down or up.
ja: キーボードキーやマウス・ジョイスティックボタンが下か上かをチェックします。

source: Checks if a process of Notepad exists.
ja: Notepadのプロセスが存在するかどうかをチェックします。

source: Checks if at least one Shift is down.
ja: 少なくとも1つのShiftがダウンしているかどうかをチェックします。

source: Checks if the Hidden attribute is present in the retrieved string.
ja: 取得した文字列に隠し属性があるかどうかをチェックします。

source: Checks if the specified monitor exists and optionally retrieves its bounding coordinates.
ja: 指定されたモニターが存在するかどうかを調べ、オプションでその境界座標を取得します。

source: Checks if the specified monitor exists and optionally retrieves the bounding coordinates of its working area.
ja: 指定されたモニターが存在するかどうかをチェックするとともに、副次的にその作業領域の境界の座標を取得します。

source: Checks if the specified process exists.
ja: 指定されたプロセスが存在するかどうかをチェックします。

source: Checks if the specified window exists and is currently active (foremost).
ja: 指定されたウィンドウが存在し、現在アクティブ（最前面）であるかどうかを調べます。

source: Checks if the specified window exists and returns the unique ID (HWND) of the first matching window.
ja: 指定されたウィンドウが存在するかどうかを調べ、最初にマッチしたウィンドウのユニークID（HWND）を返します。

source: Checks if the specified window exists.
ja: 指定されたウィンドウが存在するかどうかを調べます。

source: Checks if the specified window is active and returns its unique ID (HWND).
ja: 指定されたウィンドウがアクティブであるかどうかをチェックしてそのID（HWND）を返します。

source: Checks the version of AutoHotkey in use.
ja: 使用中のAutoHotkeyのバージョンをチェックします。

source: Checks whether "Line In pass-through" is muted.
ja: "Line In pass-through"がミュートされているかどうかをチェックします。

source: Checks whether var is a floating point number or an integer and checks whether it is a valid timestamp.
ja: varが浮動小数点数か整数かをチェックし、有効なタイムスタンプかどうかをチェックします。

source: Checks whether the default playback device is muted.
ja: デフォルトの再生デバイスがミュートされているかどうかをチェックする。

source: Checks whether the microphone (recording) is muted.
ja: マイク（録音）がミュートされているかどうかをチェックします。

source: Chinese
ja: 中国語

source: ChoicePos += 1 ; Convert from 0-based to 1-based, i.e. so that the first item is known as 1, not 0.
ja: ChoicePos += 1 ; 0ベースから1ベースへ、つまり最初の項目が0ではなく1とわかるように変換します。

source: ChoicePos := SendMessage(0x0188, 0, 0, "ListBox1", WinTitle) ; 0x0188 is LB_GETCURSEL (for a ListBox).
ja: ChoicePos := SendMessage(0x0188, 0, 0, "ListBox1", WinTitle) ; 0x0188 は、LB_GETCURSEL（リストボックスの場合）です。

source: ChoicePos := SendMessage(0x0147, 0, 0, "ComboBox1", WinTitle) ; 0x0147 is CB_GETCURSEL (for a DropDownList or ComboBox).
ja: ChoicePos := SendMessage(0x0147, 0, 0, "ComboBox1", WinTitle) ; 0x0147 は、CB_GETCURSEL（DropDownList または ComboBox の場合）です。

source: Choose Run from the Debug menu, or press F5.
ja: デバッグ」メニューから「実行」を選択するか、F5キーを押します。

source: Choose what you like or learn to indent how you think it's easiest to read.
ja: 自分の好きなものを選ぶか、自分が一番読みやすいと思うインデントの付け方を学んでください。

source: Chr - Syntax & Usage | AutoHotkey v2
ja: Chr - 構文と使用法｜AutoHotkey v2

source: Circular references must be broken before an object can be freed.
ja: オブジェクトを解放する前に、循環参照を切断しなければならない。

source: Circumflex (^) and dollar sign ($) are called anchors because they don't consume any characters; instead, they tie the pattern to the beginning or end of the string being searched.
ja: サーカムフレックス（^）とドル記号（$）は、文字を消費しないのでアンカーと呼ばれる。

source: Circumflex (^) matches immediately after all internal newlines -- as well as at the start of Haystack where it always matches (but it does not match after a newline at the very end of Haystack).
ja: サーカムフレックス（^）は、すべての内部改行の直後にマッチし、常にマッチするヘイスタックの開始部分にもマッチする（ただし、Haystackの最後の改行の後にはマッチしない）。

source: Class Initialization
ja: クラスの初期化

source: Class Object
ja: Classオブジェクト

source: Class Object - Methods & Properties | AutoHotkey v2
ja: Classオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: Class definitions can contain variable declarations, method definitions and nested class definitions.
ja: クラス定義には、変数宣言、メソッド定義、ネストされたクラス定義を含めることができます。

source: Classes
ja: クラス

source: Classes are often registered by CLSID under the HKCR\CLSID registry key.
ja: クラスは、CLSIDによってHKCRCLSIDレジストリキーの下に登録されることが多い。

source: Classes must be specified by their exact full name and not an arbitrary expression, as the Prototype of each class is resolved at load time.
ja: 各クラスのプロトタイプはロード時に解決されるため、クラスは任意の表現ではなく、正確なフルネームで指定する必要があります。

source: Clear key on keypad (usually 5 when NumLock is OFF).
ja: キーパッドのクリアキー（NumLockがOFFの場合、通常は5）。

source: ClearRows(*) ; The user selected "Clear" in the context menu.
ja: ClearRows(*) ; ユーザーがコンテキストメニューで "Clear"を選択しました。

source: Click "AutoHotkey Script" inside the "New" menu.
ja: 「新規作成」メニューから「AutoHotkey Script」をクリックします。

source: Click "Edit Script".
ja: 「Edit Script」をクリックする。

source: Click - Syntax & Usage | AutoHotkey v2
ja: Click - 構文と使用法｜AutoHotkey v2

source: Click Download.
ja: ダウンロードをクリックしてください。

source: Click on a function name for details.
ja: 関数の名称をクリックすると詳細が表示されます。

source: Click the left margin to set at least one breakpoint.
ja: 少なくとも1つのブレークポイントを設定するために、左マージンをクリックします。

source: Click the wheel to show or hide the menu, and turn it to navigate through the menu.
ja: ホイールをクリックするとメニューの表示／非表示が切り替わり、回すとメニューの移動ができます。

source: Clicking a checkbox in tile view mode only selects the item; the state does not change.
ja: タイルビューモードでチェックボックスをクリックすると、アイテムが選択されるだけで、状態は変化しない。

source: Clicks a mouse button at the specified coordinates.
ja: 指定した座標でマウスボタンをクリックします。

source: Clicks and holds the left mouse button, moves the mouse cursor to the destination coordinates, then releases the button.
ja: マウスの左ボタンをクリックしたまま、マウスカーソルを移動先の座標に移動させ、ボタンを離します。

source: Clicks and holds the specified mouse button, moves the mouse to the destination coordinates, then releases the button.
ja: 指定したマウスボタンをクリックしたまま、移動先の座標にマウスを移動し、ボタンを離します。

source: Clicks at a set of coordinates.
ja: 座標のセットでクリックします。

source: Clicks in NA mode at coordinates that are relative to a named control.
ja: NAモードでは、指定したコントロールからの相対座標でクリックします。

source: Clicks or holds down a mouse button, or turns the mouse wheel.
ja: マウスのボタンをクリックまたは長押しするか、マウスのホイールを回転させます。

source: Clicks the OK button.
ja: OKボタンをクリックします。

source: Clicks the left mouse button at a specific position.
ja: マウスの左ボタンを特定の位置でクリックします。

source: Clicks the left mouse button at the mouse cursor's current position.
ja: マウスカーソルの現在位置でマウスの左ボタンをクリックします。

source: Clicks the right mouse button at a specific position.
ja: マウスの右ボタンを特定の位置でクリックします。

source: Client coordinates are less dependent on OS version and theme.
ja: クライアント座標は、OSのバージョンやテーマに左右されにくい。

source: Client coordinates are relative to the top-left of the client area, which excludes the window's title bar and borders.
ja: クライアント座標は、ウィンドウのタイトルバーとボーダーを除いたクライアント領域の左上からの相対値です。

source: ClipContent := StrReplace(A_Clipboard, "``", "````") ; Do this replacement first to avoid interfering with the others below.
ja: ClipContent := StrReplace(A_Clipboard, "``", "````") ; 以下の他の置換と干渉しないように、この置換を最初に行います。
